app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
---
  def index
    @books = Book.order(:title)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params['id'])

INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Book1"], ["author", "Author1"], ["price", 30], ["published_date", "2024-01-10 21:16:00"], ["created_at", "2024-01-30 03:16:40.924484"], ["updated_at", "2024-01-30 03:16:40.924484"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params['id'])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "Author2"], ["updated_at", "2024-01-30 03:25:15.629726"], ["id", 1]]
---
  def update
    @book = Book.find(params['id'])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params['id'])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    @book = Book.find(params['id'])
    @book.destroy